{
    "products":[
        {
            "id": 1,
            "name": "Oneplus Open (Voyager Black, 16GB RAM, 512GB Storage)",
            "description": "Extraordinary materials blend the best of both. Titanium alloy, carbon fiber, and more. Built to the hilt with aerospace materials – with no expense spared. TÜV Rheinland “reliable folding” certified to 1,000,000 folds.Extreme durability for more than 100 folds every day – lasting over 10 years.\nDual ProXDR displays; Cover Display: 6.31” 2K resolution, Super Fluid AMOLED at 1440 Hz - Shielded by Ceramic Guard Dual-Displays: 7.82” 2K resolution, Flexi-fluid AMOLED 89.6% screen-to-body ratio at 1440 Hz - Shielded by Ultra Thin Glass\nMain camera with OIS 48MP SONY LYT-T800 “Pixel Stacked” Sensor 1/1.43” sensor, 1.12μm, ƒ/1.65, AF Telephoto with OIS 64MP OV64B Sensor with 3X Optical Zoom 6X in-sensor zoom, 1/2” sensor, 0.7 μm, ƒ/2.6, AF Ultra-wide 48MP Sony IMX581 with 114o FOV 1/2” sensor, ƒ/2.2, AF\nMinimum crease. Maximum smooth. Our patented Flexion hinge mechanism, 8-axis pressure relief, and under-display micro-weaving significantly reduce creases. The “waterdrop”-shaped tension relief mechanism ensures a larger bend radius, minimizing the display crease.",
            "price": 139000,
            "images":[
                "https://m.media-amazon.com/images/I/719QmmyMLYL._SX425_.jpg",
                "https://m.media-amazon.com/images/I/718LQXZabKL._SX425_.jpg",
                "https://m.media-amazon.com/images/I/71LIhuGh+4L._SX425_.jpg",
                "https://m.media-amazon.com/images/I/813FGVkfcbL._SX425_.jpg"
            ]
        },
        {
            "id": 2,
            "name": "OnePlus 9R 5G (Lake Blue, 8GB RAM, 128GB Storage)",
            "description": "Qualcomm Snapdragon 870 5G with upgraded Qualcomm Kryo 585 CPU that performs intense mobile computing at up to 3.2 GHz and also comes with an ultra-fast Qualcomm Adreno 650 GPU for superb on-device experiences\nLoaded with Quad rear camera module that features a 48 MP Main camera, 16 MP Ultra Wide angle Camera, 5 MP Macro camera and a 2 MP Monochrome camera. The device also comes with a 16 MP front Camera\nOnePlus 9R comes with 4500 mAh massive battery with dual cell 65W fast charging technology (Warp Charge 65T) that can charge the device fully in just 39 minutes\n6.55 Inches Fluid AMOLED display with 120 Hz of Refresh rate\nOxygen OS based on Andriod 11\nHands-Free access to Alexa: Alexa on your phone lets you make phone calls, open apps, control smart home devices, access the library of Alexa skills, and more using just your voice while on-the-go. Download the Alexa app and complete hands-free setup to get started. Just ask - and Alexa will respond instantly",
            "price": 39999,
            "images":[
                "https://m.media-amazon.com/images/I/71m05O2uNdS._SX425_.jpg",
                "https://m.media-amazon.com/images/I/71m05O2uNdS._SX425_.jpg",
                "https://m.media-amazon.com/images/I/71m05O2uNdS._SX425_.jpg",
                "https://m.media-amazon.com/images/I/71m05O2uNdS._SX425_.jpg"
            ]
        }
    ]
}
